Revit 2024 API
BuiltInFailures.DimensionFailures.WrongConstraintInGridChainSketch Property
 Curve in a GridChain sketch cannot be constrained to a sub-grid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WrongConstraintInGridChainSketch { get; }
Visual Basic
Public Shared ReadOnly Property WrongConstraintInGridChainSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WrongConstraintInGridChainSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace